Tekla Open API Reference for Tekla Structures 2025
ProfileCatalog Constructor (String)
 Initiates a new instance of the control selecting the given profile.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileCatalog(
	string Profile
)
Public Sub New (
	Profile As String
)
Parameters
Profile
Type: System.String
The profile string that will be selecteed in the dialog.
See Also
Reference
ProfileCatalog Class
ProfileCatalog Overload
Tekla.Structures.Dialog.UIControls Namespace